Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF.#ctor(System.Double,System.Double,System.Double,System.Double,Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionAnalysisParams)
Creates a new instance of Structural Section Flat Bar.
width:
Section width.
height:
Section height, depth.
centroidHorizontal:
Distance from centroid to the left extremites along horizontal axis.
centroidVertical:
Distance from centroid to the upper extremites along vertical axis.
analysisParams:
Common set of parameters for structural analysis.
Since:
2018

Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralF
Defines parameters for Flat Bar.
Since:
2018